Revit 2024 API
BuiltInFailures.AlignmentFailures Class
 Failures related to alignment elements and annotations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class AlignmentFailures
Visual Basic
Public NotInheritable Class AlignmentFailures
Visual C++
public ref class AlignmentFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures
See Also
BuiltInFailures.AlignmentFailures Members
Autodesk.Revit.DB Namespace